Revit 2020 API
UnitFormatUtils.Format Method (Units, UnitType, Double, Boolean, Boolean, FormatValueOptions)
 Formats a number with units into a string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static string Format(
	Units units,
	UnitType unitType,
	double value,
	bool maxAccuracy,
	bool forEditing,
	FormatValueOptions formatValueOptions
)
Visual Basic
Public Shared Function Format ( _
	units As Units, _
	unitType As UnitType, _
	value As Double, _
	maxAccuracy As Boolean, _
	forEditing As Boolean, _
	formatValueOptions As FormatValueOptions _
) As String
Visual C++
public:
static String^ Format(
	Units^ units,
	UnitType unitType,
	double value,
	bool maxAccuracy,
	bool forEditing,
	FormatValueOptions^ formatValueOptions
)
Parameters
units
Type: Autodesk.Revit.DB.Units
 The units formatting settings, typically obtained from Document.GetUnits().
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type of the value to format.
value
Type: System.Double
 The value to format, in Revit's internal units.
maxAccuracy
Type: System.Boolean
 True if the value should be rounded to an increased accuracy level appropriate for editing or understanding the precise value stored in the model. False if the accuracy specified by the FormatOptions should be used, appropriate for printed drawings.
forEditing
Type: System.Boolean
 True if the formatting should be modified as necessary so that the formatted string can be successfully parsed, for example by suppressing digit grouping. False if unmodified settings should be used, suitable for display only.
formatValueOptions
Type: Autodesk.Revit.DB.FormatValueOptions
 Additional formatting options.
Return Value
 The formatted string.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  unitType is an invalid unit type. See UnitUtils.IsValidUnitType() and UnitUtils.GetValidUnitTypes(). -or- The given value for value is not finite -or- The display unit in the FormatOptions in formatValueOptions is not a valid display unit for unitType. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
UnitFormatUtils Class
Format Overload
Autodesk.Revit.DB Namespace